# Target Mean Encoding by `Mr. Harshit Dawar!`
### In case of Classification

* It is a method where the values of any feature are replaced by their mean values corresponding to the Target Variable, & then the actual values are comapred with the encoded values as predictions to select the Features.
### In case of Regression
* Values of features are first divided into bins, & then they are replaced by their mean values corresponding to the Target Variable, & then the actual values are comapred with the encoded values as predictions to select the Features.

## Mean Target Encoding the Categorical Variables

In [1]:
# Importing the Libraries

import pandas as pd
import numpy as np

from sklearn.metrics import roc_auc_score

In [11]:
# Loading the Data!

data = pd.read_csv("../ds/Titanic_Dataset.csv")

In [12]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
data.drop(["PassengerId", "Name", "SibSp", "Ticket", "Fare"], axis = 1, inplace = True)

In [14]:
data.head()

   Survived  Pclass     Sex   Age  Parch Cabin Embarked
0         0       3    male  22.0      0   NaN        S
1         1       1  female  38.0      0   C85        C
2         1       3  female  26.0      0   NaN        S
3         1       1  female  35.0      0  C123        S
4         0       3    male  35.0      0   NaN        S

In [15]:
data.Cabin = data.Cabin.str[0]

In [16]:
data.head()

   Survived  Pclass     Sex   Age  Parch Cabin Embarked
0         0       3    male  22.0      0   NaN        S
1         1       1  female  38.0      0     C        C
2         1       3  female  26.0      0   NaN        S
3         1       1  female  35.0      0     C        S
4         0       3    male  35.0      0   NaN        S

In [17]:
data.dropna(axis = 0, inplace = True)

In [18]:
data.head()

    Survived  Pclass     Sex   Age  Parch Cabin Embarked
1          1       1  female  38.0      0     C        C
3          1       1  female  35.0      0     C        S
6          0       1    male  54.0      0     E        S
10         1       3  female   4.0      1     G        S
11         1       1  female  58.0      0     C        S

In [19]:
data.Cabin.unique()

array(['C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [20]:
# creating a function to perform the Target Mean Encoding
def Target_Mean_Encoding(data, categorical_Variable):
    return data.groupby(categorical_Variable)["Survived"].mean().to_dict()

In [23]:
categorical_Variables = ["Sex", "Cabin", "Embarked", "Pclass"]

for col in categorical_Variables:
    data[col] = data[col].map(Target_Mean_Encoding(data, col))

In [24]:
data.head()

    Survived    Pclass       Sex   Age  Parch     Cabin  Embarked
1          1  0.670886  0.931818  38.0      0  0.588235  0.738462
3          1  0.670886  0.931818  35.0      0  0.588235  0.637931
6          0  0.670886  0.431579  54.0      0  0.733333  0.637931
10         1  0.500000  0.931818   4.0      1  0.500000  0.637931
11         1  0.670886  0.931818  58.0      0  0.588235  0.637931

## Mean Target Encoding the Numerical Variables

In [39]:
d, bins = pd.qcut(x = data.Age, q = 3, precision = 3, retbins = True, labels = False )

In [48]:
pd.cut(x = data["Age"], bins = bins, labels = False)

1      1.0
3      1.0
6      2.0
10     0.0
11     2.0
      ...
871    2.0
872    1.0
879    2.0
887    0.0
889    0.0
Name: Age, Length: 183, dtype: float64

In [46]:
data.shape

(183, 7)

In [51]:
data.drop("Parch", axis = 1, inplace = True)

In [52]:
data["Age"] = data["Age"].map(Target_Mean_Encoding(data, "Age"))

In [53]:
data.head()

    Survived    Pclass       Sex       Age     Cabin  Embarked
1          1  0.670886  0.931818  0.750000  0.588235  0.738462
3          1  0.670886  0.931818  1.000000  0.588235  0.637931
6          0  0.670886  0.431579  0.333333  0.733333  0.637931
10         1  0.500000  0.931818  1.000000  0.500000  0.637931
11         1  0.670886  0.931818  0.600000  0.588235  0.637931